Revit 2027 API
ViewCropRegionShapeManager.RemoveSplit Method
 Removes any split applied to the view's crop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSplit()
Public Sub RemoveSplit
public:
void RemoveSplit()
member RemoveSplit : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  The crop of the associated view is not permitted to have multiple regions.
See Also
Reference
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace